# Операции со множествами в Python:
a = {1, 2, 3, 5, 8}
b = {2, 5, 8, 13, 21}
# c = a.copy() # c = {1, 2, 3, 5, 8} копирование
# u = a.union(b) # u = {1, 2, 3, 5, 8, 13, ] объединение
# print(u)
# d1 = a.difference(b) # d1 = (1, 3) вычитание из а вычитаем b
# print(d1)
# i = a.intersection(b) # i = {8, 2, 5} пересечение
# q = a.union(b).difference(a.intersection(b)) # (1, 21, 3, 13)

"""
Неизменяемое или замороженное множество(frozenset) — множество, с которым не будут
работать методы удаления и добавления.
"""
a = {1, 8, 6}
b = frozenset(a)
print(b) # frozenset({1, 8, 6})